config.el
;; [[file:README.org::*Package Manager][Package Manager:1]]
(defvar elpaca-installer-version 0.4)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                            :ref nil
                            :files (:defaults (:exclude "extensions"))
                            :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
    (build (expand-file-name "elpaca/" elpaca-builds-directory))
    (order (cdr elpaca-order))
    (default-directory repo))
(add-to-list 'load-path (if (file-exists-p build) build repo))
(unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                ((zerop (call-process "git" nil buffer t "clone"
                                    (plist-get order :repo) repo)))
                ((zerop (call-process "git" nil buffer t "checkout"
                                    (or (plist-get order :ref) "--"))))
                (emacs (concat invocation-directory invocation-name))
                ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                    "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                ((require 'elpaca))
                ((elpaca-generate-autoloads "elpaca" repo)))
            (kill-buffer buffer)
        (error "%s" (with-current-buffer buffer (buffer-string))))
    ((error) (warn "%s" err) (delete-directory repo 'recursive))))
(unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))


;; Install use-package support
(elpaca elpaca-use-package
;; Enable :elpaca use-package keyword.
(elpaca-use-package-mode)
;; Assume :elpaca t unless otherwise specified.
(setq elpaca-use-package-by-default t))

;; Block until current queue processed.
(elpaca-wait)

;;For example:
;;(use-package general :demand t)
;;(elpaca-wait)

;;Turns off elpaca-use-package-mode current declartion
;;Note this will cause the declaration to be interpreted immediately (not deferred).
;;Useful for configuring built-in emacs features.
(use-package emacs :elpaca nil :config (setq ring-bell-function #'ignore))

;; Don't install anything. Defer execution of BODY
(elpaca nil (message "deferred"))
;; Package Manager:1 ends here

;; [[file:README.org::*Evil Mode][Evil Mode:1]]
;; Expands to: (elpaca evil (use-package evil :demand t))
(use-package evil
    :init      ;; tweak evil's configuration before loading it
    (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
    (setq evil-want-keybinding nil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    :config
    (evil-mode 1)

    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    ;; This is necessary for org mode folding to work
    (evil-define-key 'normal 'org-mode-map (kbd "<tab>") 'org-cycle)
    
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal)
)

(use-package evil-collection
    :after evil
    :config
    (setq evil-collection-mode-list '(dashboard dired ibuffer))
    (evil-collection-init)
)

(use-package evil-tutor)
;; Evil Mode:1 ends here

;; [[file:README.org::*General Keybindings][General Keybindings:1]]
(use-package general
      :config
      (general-evil-setup)

      ;; set up 'SPC' as the global leader key
      (general-create-definer md/leader-keys
      :states '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC" ;; set leader
      :global-prefix "M-SPC") ;; access leader in insert mode

      (md/leader-keys
      "b" '(:ignore t :wk "Buffer")
      "b b" '(switch-to-buffer :wk "Switch buffer")
      "b i" '(ibuffer :wk "Ibuffer")
      "b k" '(kill-this-buffer :wk "Kill this buffer")
      "b n" '(next-buffer :wk "Next buffer")
      "b p" '(previous-buffer :wk "Previous buffer")
      "b r" '(revert-buffer :wk "Reload buffer"))

      (md/leader-keys
      "h" '(:ignore t :wk "Help")
      "h f" '(counsel-describe-function :wk "Describe function")
      "h v" '(counsel-describe-variable :wk "Describe variable"))

      (md/leader-keys
      "." '(counsel-find-file :wk "Find file")
      "f c" '((lambda () (interactive) (counsel-find-file "~/.emacs.d/README.org")) :wk "Edit emacs config")
      "f r" '(counsel-recentf :wk "Find recent files")
      "TAB TAB" '(comment-line :wk "(Un)comment line"))

      (md/leader-keys
      "t" '(:ignore t :wk "Toggle")
      "t l" '(display-line-numbers-mode :wk "Toggle line numbers")
      "t t" '(visual-line-mode :wk "Toggle truncated lines"))

      (md/leader-keys
      :keymaps 'org-mode-map
      "o" '(:ignore t :wk "Org mode")
      "o l" '(org-insert-link :wk "Insert link")
      "o o" '(org-open-at-point :wk "Open link")
      "o t" '(org-babel-tangle :wk "Tangle file")
      "o c" '(org-toggle-checkbox :wk "Toggle checkbox")
      "o s" '(org-schedule :wk "Insert schedule")
      "o d" '(org-deadline :wk "Insert deadline")
      "o a" '(:ignore t :wk "Org agenda")
      "o a a" '(org-agenda :wk "Org agenda")
      "o a l" '(org-agenda-list :wk "Org agenda list")
      )
)

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
;; General Keybindings:1 ends here

;; [[file:README.org::*Diminish][Diminish:1]]
(use-package diminish)
;; Diminish:1 ends here

;; [[file:README.org::*Ivy List Utility][Ivy List Utility:1]]
(use-package counsel
    :after ivy
;    :bind (("M-x" . counsel-M-x)
;           ("C-x b" . counsel-ibuffer)
;           ("C-x C-f" . counsel-find-file)
;           :map minibuffer-local-map
;           ("C-r" . 'counsel-minibuffer-history))
    :config
    (counsel-mode)
    (setq ivy-initial-inputs-alist nil)) ;; Don't start searches with ^

(use-package ivy
    :diminish
    :config
    (ivy-mode))

(use-package all-the-icons-ivy-rich
    :ensure t
    :init (all-the-icons-ivy-rich-mode 1))

(use-package ivy-rich
  :after ivy
  :ensure t
  :init (ivy-rich-mode 1) ;; this gets us descriptions in M-x.
  :custom
  (ivy-virtual-abbreviate 'full
   ivy-rich-switch-buffer-align-virtual-buffer t
   ivy-rich-path-style 'abbrev)
  :config
  (ivy-set-display-transformer 'ivy-switch-buffer
                               'ivy-rich-switch-buffer-transformer))
;; Ivy List Utility:1 ends here
