config.el

;; [[file:README.org::*Helpful][Helpful:1]]
(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
;; Helpful:1 ends here

;; [[file:README.org::*Projectile][Projectile:1]]
(use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :init
    (when (file-directory-p "~/Projects")
        (setq projectile-project-search-path '("~/Projects")))
    (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
    :config (counsel-projectile-mode))
;; Projectile:1 ends here

;; [[file:README.org::*Magit][Magit:1]]
(use-package magit
    :custom 
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

;; This is deprecated. Use evil-collection instead
;; (use-package evil-magit
;;     :after magit)

;; More like live in emacs package
(use-package forge)
;; Magit:1 ends here

;; [[file:README.org::*Dashboard][Dashboard:1]]
(use-package dashboard
    :ensure t
    :after org
    :init
    (progn
    (setq dashboard-items '((recents . 5)
                            (bookmarks . 5)
                            (projects . 5)
                            (agenda . 5)
                            (registers . 5)))
    (setq dashboard-show-shortcuts t)
    (setq dashboard-center-content nil)
    (setq dashboard-banner-logo-title "Welcome aboard captain.")
    (setq dashboard-set-file-icons t)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-startup-banner 'logo)

    (setq dashboard-set-navigator t)
    (setq dashboard-navigator-buttons
    `(;; line1
    ((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
    "Homepage"
    "Browse homepage"
    (lambda (&rest _) (browse-url "homepage")))
    ("★" "Star" "Show stars" (lambda (&rest _) (show-stars)) warning)
    ("?" "" "?/h" #'show-help nil "<" ">"))
    ;; line 2
    ((,(all-the-icons-faicon "linkedin" :height 1.1 :v-adjust 0.0)
    "Linkedin"
    ""
    (lambda (&rest _) (browse-url "homepage")))
    ("⚑" nil "Show flags" (lambda (&rest _) (message "flag")) error)))))
    
 
    :config
    (dashboard-setup-startup-hook)
)
;; Dashboard:1 ends here

;; [[file:README.org::*Disable Menubar, Toolbars and Scrollbars][Disable Menubar, Toolbars and Scrollbars:1]]
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-startup-message t)
(setq visible-bell t)
;; Disable Menubar, Toolbars and Scrollbars:1 ends here

;; [[file:README.org::*Display Line Numbers and Truncated Lines][Display Line Numbers and Truncated Lines:1]]
(column-number-mode)
(global-display-line-numbers-mode 1)
(global-visual-line-mode t)

(setq display-line-numbers-type 'relative)

(dolist (mode '(term-mode-hook
                shell-mode-hook
                eshell-mode-hook))
    (add-hook mode(lambda () (display-line-numbers-mode 0))))
;; Display Line Numbers and Truncated Lines:1 ends here

;; [[file:README.org::*Scrolling][Scrolling:1]]
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
(setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
(setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
(setq scroll-step 1) ;; keyboard scroll one line at a time
;; Scrolling:1 ends here

;; [[file:README.org::*Modeline][Modeline:1]]
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom (doom-modeline-height 32))
;; Modeline:1 ends here

;; [[file:README.org::*Theme][Theme:1]]
;; (load-theme 'deeper-blue t)

(use-package doom-themes
  :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-one t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))
;; Theme:1 ends here

;; [[file:README.org::*Fonts][Fonts:1]]
(set-face-attribute 'default nil
    :font "JetBrains Mono"
    :height 110
    :weight 'medium)
(set-face-attribute 'variable-pitch nil
    :font "Ubuntu"
    :height 120
    :weight 'medium)
(set-face-attribute 'fixed-pitch nil
    :font "JetBrains Mono"
    :height 110
    :weight 'medium)
;; Makes commented text and keywords italics.
;; This is working in emacsclient but not emacs.
;; Your font must have an italic face available.
(set-face-attribute 'font-lock-comment-face nil
    :slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil
    :slant 'italic)

;; This sets the default font on all graphical frames created after restarting Emacs.
;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
;; are not right unless I also add this method of setting the default font.
(add-to-list 'default-frame-alist '(font . "JetBrains Mono-12"))

;; Uncomment the following line if line spacing needs adjusting.
(setq-default line-spacing 0.12)
;; Fonts:1 ends here

;; [[file:README.org::*Icons][Icons:1]]
(use-package all-the-icons
    :ensure t
    :if (display-graphic-p))

(use-package all-the-icons-dired
    :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))

(use-package nerd-icons
  ;; :custom
  ;; The Nerd Font you want to use in GUI
  ;; "Symbols Nerd Font Mono" is the default and is recommended
  ;; but you can use any other Nerd Font if you want
  ;; (nerd-icons-font-family "Symbols Nerd Font Mono")
 )
;; Icons:1 ends here

;; [[file:README.org::*Rainbow Brackets][Rainbow Brackets:1]]
(use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
;; Rainbow Brackets:1 ends here
