config.el

;; [[file:README.org::*ORG][ORG:1]]
(defun md/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
 (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

(defun md/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 0) ;; TODO Fucks up line numbers, gotta change their faces specificly
    (visual-line-mode 1))

(use-package org
    :pin org
    :commands (org-capture org-agenda)
    :hook (org-mode . md/org-mode-setup)
    :config
    (setq org-ellipsis " ▾")
    (setq org-hide-emphasis-markers t)

    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (setq org-agenda-files
        '("~/Stuff/org-files/tasks.org"
          "~/Stuff/org-files/habits.org"
          "~/Stuff/org-files/birthdays.org"))

    (md/org-font-setup))

(defun md/org-mode-visual-fill ()
  (setq visual-fill-column-width 120
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . md/org-mode-visual-fill))
;; ORG:1 ends here

;; [[file:README.org::*Enabling Table of Contents][Enabling Table of Contents:1]]
(use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
;; Enabling Table of Contents:1 ends here

;; [[file:README.org::*Enabling Org Bullets][Enabling Org Bullets:1]]
(use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode))
;; Enabling Org Bullets:1 ends here

;; [[file:README.org::*Disable Electric Indent][Disable Electric Indent:1]]
(electric-indent-mode -1)
;; Disable Electric Indent:1 ends here

;; [[file:README.org::*Org Tempo][Org Tempo:1]]
(require 'org-tempo)
;; Org Tempo:1 ends here

;; [[file:README.org::*WHICH Key][WHICH Key:1]]
(use-package which-key
    :init
    (which-key-mode 1)
    :diminish which-key-mode
    :config
    (setq which-key-side-window-location 'bottom
        which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 6
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-idle-delay 0.3
        which-key-max-description-length 25
        which-key-allow-imprecise-window-fit t
        which-key-separator " → " ))
;; WHICH Key:1 ends here
